old_code/config/basecase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libmyLiquids8.so"
    "libcompressibleTools.so"    
);

application     twoSprayChtMultiRegionCentralFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          1e-06;

writeControl    adjustable;

writeInterval   5e-04;

purgeWrite      20;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   12;

adjustTimeStep  yes;

runTimeModifiable yes;

maxCo           0.4;

//maxCo constant 0.4;
//
//rDeltaTSmoothingCoeff table
//(
//    (  0 0.0001)
//    (100 0.001)
//    (200 0.025)
//);
//
//rDeltaTDampingCoeff constant 0.9;
//
//initialDeltaT   0.1e-6;

maxDeltaT       1e-3;

CourantType     cellCourant; //faceCourant;

// ************************************************************************* //
