old_code/config/basecase/constant/fluid/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

combustionModel laminar; //laminar(=PSR); //PaSR; //EDC; //none;

active          yes;

laminarCoeffs
{
}

PaSRCoeffs
{
    Cmix                1.0;
    turbulentReaction   yes;
}

EDCCoeffs
{
    version v2005;
}

// ************************************************************************* //
