old_code/config/basecase/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel thermoSingleLayer; //thermoSingleLayer;

region           filmRegion; //filmRegion;

active           true; //true;

thermoSingleLayerCoeffs
{
    filmThermoModel liquid;

    liquidCoeffs
    {
        useReferenceValues no;
        liquid      CH3NHNH2;
    }

    filmViscosityModel liquid;

    deltaWet    60e-6;  // 1e-4; for water ?

    hydrophilic no;

    radiationModel  none;
    standardRadiationCoeffs  //--fireFoam ex
    {
        beta     0.75;
        kappaBar 0.25;
    }    

    turbulence  laminar;
    laminarCoeffs
    {
        Cf          0.001; //0.005;
    }

    upperSurfaceModels
    {
        heatTransferModel constant; //mappedConvectiveHeatTransfer;
        constantCoeffs
        {
            c0              10;  //fireFoam
        }        
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;
        constantCoeffs
        {
            c0              100; //50 //100 fireFoam
        }
    }

    forces
    (
        thermocapillary
    );

    injectionModels
    (
        //curvatureSeparation
        //drippingInjection
        //BrunDrippingInjection
    );

//    curvatureSeparationCoeffs
//    {
//        definedPatchRadii
//        (
//            ("(cube[0-9][0-9]_side[0-9]_to_cube[0-9][0-9]_side[0-9])" 0)
//        );
//    }

//    drippingInjectionCoeffs
//    {
//        cloud        sprayMMHCloud;
//        deltaStable  0;
//
//        particlesPerParcel 100.0;
//
//        parcelDistribution
//        {
////            type         RosinRammler;
////            RosinRammlerDistribution
////            {
////                minValue        500.0e-06;
////                maxValue        1200.0e-06;
////                d               75.0e-06;
////                n               0.5;
//            }
//            type        RosinRammler;
//            RosinRammlerDistribution
//            {
//                minValue        5.0e-6;
//                maxValue        50.0e-6;
//                d               30.0e-6;
//                n               0.5; //2.2;
//            }                 
//        }
//    }
//
//    BrunDrippingInjectionCoeffs
//    {
//        cloud        sprayMMHCloud;
//        ubarStar     1.62208;
//        dCoeff       3.3;
//        deltaStable  0;
//    }

    phaseChangeModel standardPhaseChange;

    standardPhaseChangeCoeffs
    {
        Tb              360.81; // 373; water
        deltaMin        1e-8;   // Minimum film height for active, 1e-8; water
        L               7e-3;   //1.0; //chamber dia. 7mm // 1.0; // Length scale
    }
}


// ************************************************************************* //
