old_code/config/basecase/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// ************************************************************************* //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (0 0 0);

boundaryField
{
    "(fluid_to_.*)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "(min.*|max.*)"
    {
        type            zeroGradient;
//        type            inletOutlet;
//        phi             phi;
//        inletValue      uniform (0 0 0);
//        value           uniform (0 0 0);
    }        
}


// ************************************************************************* //
