old_code/config/basecase/0.orig/fluid/AR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      AR;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 1;

boundaryField
{
    "(fluid_to_.*)"
    {
        type            zeroGradient;
    }

    "(min.*|max.*)"
    {
        type            zeroGradient;
    }       
}


// ************************************************************************* //
