old_code/config/basecase/0.orig/fluid/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 9.78e-5;

boundaryField
{
    "(fluid_to_.*)"
    {
        type            nutUSpaldingWallFunction;        
        value           $internalField;
    }

    "(min.*|max.*)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
