old_code/config/basecase/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;  //leastSquares;
    //limiter         cellLimited Gauss linear 1;
    //limiter         cellMDLimited Gauss linear 1;    
    limiter         cellLimited<Venkatakrishnan> Gauss linear 1;
    //limiter         cellLimited<cubic> 1.5 Gauss linear 1;
    grad(U)         $limiter;
    grad(p)         $limiter;
    grad(h)         $limiter;
    grad(K)         $limiter;
}

defaultAdvScheme     Minmod;  //Gamma 0.5;  //vanLeer;
defaultAdvSchemeV    MinmodV; //GammaV 0.5; //vanLeerV;

divSchemes
{
    default         none;

    //momentum equation
    div(phi_nei,U)	Gauss $defaultAdvSchemeV;
    div(phi_own,U)	Gauss $defaultAdvSchemeV;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    //energy equation
    div(phi_nei,h)	Gauss $defaultAdvScheme;
    div(phi_own,h)	Gauss $defaultAdvScheme;
    div(phi_nei,K)	Gauss $defaultAdvScheme;
    div(phi_own,K)	Gauss $defaultAdvScheme;
    div(alphaEff*hi,grad(Yi)) Gauss linear;
    div(rhoi*Uri,hi)    Gauss linear;

    //continuity equation
    div(phid_nei,p)	Gauss $defaultAdvScheme;
    div(phid_own,p)	Gauss $defaultAdvScheme;

    //turbulence
    div(phi,k)       Gauss upwind; //Minmod; 
    div(phi,epsilon) Gauss upwind; //Minmod;
    div(phi,omega)   Gauss upwind; //Minmod;
    
    //mixture component transport equation
    div(phi_nei,Yi)	Gauss $defaultAdvScheme;
    div(phi_own,Yi)	Gauss $defaultAdvScheme;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         none;
    
    interpolate(rho)        linear;    
//    interpolate((rho*U))	linear;
    interpolate(((rho*nut)+thermo:mu)) linear;    
    
    reconstruct(rho)		$defaultAdvScheme;
    reconstruct(rhoHat)     $defaultAdvScheme;        
    reconstruct(psi)		$defaultAdvScheme;
    reconstruct(p)		    $defaultAdvScheme;
    reconstruct(U)		    $defaultAdvSchemeV;
//    reconstruct(rho*U)		$defaultAdvSchemeV;
    reconstruct(Dp)		    $defaultAdvScheme;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default	none;
    p;h;Yi;
//RM29NT1 RM31N
     CH3;CH3NHNH2;CH3NN;CH3NNH;CH3NNH2;CH3O;CH4;CO;CO2;H;H2;H2O;H2CN;HCN;
     HNC;HNCO;HNO3;HONO;O;O2;OH;N;N2;N2O4;NH;NH2;NH3;NO;NO2; 
}

wallDist
{
    method  meshWave;
}

// ************************************************************************* //
