old_code/config/basecase/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|U|h|p|k|omega|epsilon|Yi).*"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
        tolerance       1e-015;
        relTol          0.0;
    }
}

PIMPLE
{
                                
    momentumPredictor           false;    //PIMPLE  //SIMPLE  //PISO
    nCorrectors                 2;        //2; n>=2 //1; n=1  //2; n=2
    nOuterCorrectors            1;        //20;n>1  //2; n>>1 //1; n=1
    nNonOrthogonalCorrectors    0;    
    nonOrthogonalityThreshold   60;
    skewnessThreshold           0.5;
    updateEnergyInPISO          false;
    fluxScheme                  Kurganov; //Tadmor;
    
    kappaFunction
    {
        type standardMachToAcCourantRatio;
        
        standardMachToAcCourantRatioCoeffs
        {
        }
    }
}


// ************************************************************************* //
    //PIMPLE mode
    //nCorrectors         2;   // n>=2
    //nOuterCorrectors    3;  // n>1

    //SIMPLE mode
    //nCorrectors         1;   // n=1    
    //nOuterCorrectors    3;   // n>>1
        
    //PISO mode
    //nCorrectors         2;   // n=2   
    //nOuterCorrectors    1;   // n=1


// ************************************************************************* //
