old_code/config/basecase/system/fluid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    fluid_to_header
    {
        inGroups        1(wall);
    }

    fluid_to_throatPtRh
    {
        inGroups        1(wall);
    }

    fluid_to_ccNimonic
    {
        sampleRegion    ccNimonic;
        samplePatch     ccNimonic_to_fluid;
    }
}



// ************************************************************************* //
