old_code/config/basecase/system/fluid/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          filmRegion;

faceZones       (filmFaces);

sampleMode      nearestPatchFace;

oneD            false;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

adaptMesh       yes; // apply mapped to both regions

linearNormalCoeffs
{
    thickness       250e-6;  // BL thickness
}


// ************************************************************************* //
