old_code/config/basecase/system/hosts
node1 cpu=32
node2 cpu=32
